"""
===========================================================================
Завдання 19. Побудова графіків розв'язку задачі Коші для рівняння
теплопровідності при розповсюдженні теплового імпульсу довільної форми
в залежності від часу t.
===========================================================================

Теоретична основа (за книгою С. Фарлоу, "Рівняння в частинних похідних"):
----------------------------------------------------------------------
Задача Коші для рівняння теплопровідності на нескінченній прямій:
    u_t = α² · u_xx,   -∞ < x < ∞,  t > 0
    u(x, 0) = φ(x)     — початковий розподіл температури (довільна форма)

Розв'язок через формулу згортки з фундаментальним розв'язком:
    u(x, t) = ∫_{-∞}^{+∞} G(x - ξ, t) · φ(ξ) dξ

де G(x, t) = 1/√(4πα²t) · exp(-x²/(4α²t)) — фундаментальний розв'язок
(ядро теплопровідності).

Фізичний зміст: кожна точка початкового розподілу φ(ξ) є "мікро-імпульсом",
і результуючий розв'язок — суперпозиція (інтеграл) відгуків на всі
такі мікро-імпульси.

У програмі розглядаються три різні форми початкового розподілу:
1) Прямокутний імпульс (східчаста функція)
2) Трикутний імпульс
3) Гауссівський імпульс (плавна форма)
===========================================================================
"""

import numpy as np
import matplotlib.pyplot as plt
from scipy.integrate import quad
from matplotlib.gridspec import GridSpec

# ============================================================
# Параметри задачі
# ============================================================
alpha = 1.0           # Коефіцієнт температуропровідності
x_min, x_max = -8, 8  # Межі просторової області
N_x = 400             # Кількість точок по x

# Моменти часу для побудови графіків
time_values = [0.0, 0.05, 0.2, 0.5, 1.0, 3.0]

# ============================================================
# Фундаментальний розв'язок (ядро теплопровідності)
# ============================================================
def heat_kernel(x, t, alpha):
    """
    Фундаментальний розв'язок (функція Гріна) рівняння теплопровідності.
    G(x, t) = 1/√(4πα²t) · exp(-x²/(4α²t))
    """
    if t <= 0:
        return 0.0
    return (1.0 / np.sqrt(4 * np.pi * alpha**2 * t)) * np.exp(-x**2 / (4 * alpha**2 * t))


# ============================================================
# Визначення початкових умов (три варіанти довільної форми)
# ============================================================
def phi_rectangular(x):
    """
    Прямокутний імпульс:
    φ(x) = 1 при |x| ≤ 1, φ(x) = 0 інакше.
    
    Фізичний зміст: рівномірний нагрів відрізка [-1, 1].
    """
    return np.where(np.abs(x) <= 1.0, 1.0, 0.0)


def phi_triangular(x):
    """
    Трикутний імпульс:
    φ(x) = 1 - |x| при |x| ≤ 1, φ(x) = 0 інакше.
    
    Фізичний зміст: нагрів з максимумом у центрі, що лінійно
    спадає до нуля на краях.
    """
    return np.where(np.abs(x) <= 1.0, 1.0 - np.abs(x), 0.0)


def phi_gaussian(x):
    """
    Гауссівський імпульс:
    φ(x) = exp(-2x²)
    
    Фізичний зміст: плавний нагрів з максимумом у центрі.
    Це гладка функція, яка добре апроксимує реальні фізичні ситуації.
    """
    return np.exp(-2.0 * x**2)


# ============================================================
# Розв'язок задачі Коші через інтеграл згортки
# ============================================================
def solve_cauchy(x_arr, t, alpha, phi_func, xi_range=(-10, 10)):
    """
    Обчислює розв'язок задачі Коші для рівняння теплопровідності:
    
    u(x, t) = ∫_{-∞}^{+∞} G(x - ξ, t) · φ(ξ) dξ
    
    де G — фундаментальний розв'язок (ядро теплопровідності),
    φ — початковий розподіл температури.
    
    Параметри:
    ----------
    x_arr : numpy array
        Масив просторових координат
    t : float
        Момент часу
    alpha : float
        Коефіцієнт температуропровідності
    phi_func : callable
        Функція початкового розподілу φ(x)
    xi_range : tuple
        Межі інтегрування (апроксимація ±∞)
    
    Повертає:
    ---------
    u : numpy array
        Значення температури u(x, t) у заданих точках
    """
    if t <= 0:
        # При t = 0 розв'язок = початкова умова
        return phi_func(x_arr)
    
    u = np.zeros_like(x_arr, dtype=float)
    
    for i, xi in enumerate(x_arr):
        # Підінтегральна функція: G(x - ξ, t) · φ(ξ)
        def integrand(zeta):
            return heat_kernel(xi - zeta, t, alpha) * phi_func(np.array([zeta]))[0]
        
        # Чисельне інтегрування
        result, _ = quad(integrand, xi_range[0], xi_range[1], limit=100)
        u[i] = result
    
    return u


# ============================================================
# Побудова графіків для всіх трьох типів імпульсів
# ============================================================
# Масив просторових координат
x = np.linspace(x_min, x_max, N_x)

# Список початкових умов та їх назв
initial_conditions = [
    (phi_rectangular, "Прямокутний імпульс\nφ(x) = 1, |x| ≤ 1"),
    (phi_triangular, "Трикутний імпульс\nφ(x) = 1 - |x|, |x| ≤ 1"),
    (phi_gaussian, "Гауссівський імпульс\nφ(x) = exp(-2x²)")
]

# Кольорова палітра
colors = plt.cm.viridis(np.linspace(0.1, 0.9, len(time_values)))

fig, axes = plt.subplots(1, 3, figsize=(20, 7))

for col, (phi_func, title) in enumerate(initial_conditions):
    ax = axes[col]
    
    for i, t in enumerate(time_values):
        print(f"  Обчислення: {title.split(chr(10))[0]}, t = {t}...")
        
        # Обчислюємо розв'язок для заданого моменту часу
        u = solve_cauchy(x, t, alpha, phi_func)
        
        # Стиль лінії: t=0 — пунктир (початкова умова), інші — суцільна
        linestyle = '--' if t == 0.0 else '-'
        linewidth = 2.5 if t == 0.0 else 1.8
        
        ax.plot(x, u, color=colors[i], linestyle=linestyle,
                linewidth=linewidth, label=f't = {t}')
    
    ax.set_xlabel('x', fontsize=12)
    ax.set_ylabel('u(x, t)', fontsize=12)
    ax.set_title(title, fontsize=12, fontweight='bold')
    ax.legend(fontsize=9, loc='upper right')
    ax.grid(True, alpha=0.3)
    ax.set_xlim(x_min, x_max)
    ax.set_ylim(-0.05, 1.2)

plt.suptitle(
    'Завдання 19: Розв\'язок задачі Коші — розповсюдження теплового імпульсу довільної форми\n'
    r'$u(x,t) = \int_{-\infty}^{+\infty} G(x-\xi, t) \cdot \varphi(\xi) \, d\xi$'
    f',  α = {alpha}',
    fontsize=14, fontweight='bold', y=1.05
)
plt.tight_layout()
plt.savefig('graphs.png', dpi=150, bbox_inches='tight')
plt.show()

# ============================================================
# Додатковий графік: 3D-візуалізація для прямокутного імпульсу
# ============================================================
print("\nОбчислення 3D-візуалізації (прямокутний імпульс)...")

fig2, ax2 = plt.subplots(figsize=(12, 8), subplot_kw={'projection': '3d'})

x_3d = np.linspace(-5, 5, 150)
t_3d = np.linspace(0.01, 2.0, 60)

# Масив для зберігання розв'язку
U = np.zeros((len(t_3d), len(x_3d)))

for j, t_val in enumerate(t_3d):
    U[j, :] = solve_cauchy(x_3d, t_val, alpha, phi_rectangular)

X, T = np.meshgrid(x_3d, t_3d)

surf = ax2.plot_surface(X, T, U, cmap='coolwarm', alpha=0.85,
                        edgecolor='none', antialiased=True)
ax2.set_xlabel('x', fontsize=12)
ax2.set_ylabel('t', fontsize=12)
ax2.set_zlabel('u(x, t)', fontsize=12)
ax2.set_title(
    'Завдання 19: 3D — розповсюдження прямокутного теплового імпульсу',
    fontsize=13, fontweight='bold'
)
fig2.colorbar(surf, ax=ax2, shrink=0.5, aspect=10, label='u(x, t)')
ax2.view_init(elev=25, azim=-60)
plt.tight_layout()
plt.savefig('graphs_3d.png', dpi=150, bbox_inches='tight')
plt.show()

print("=" * 60)
print("Завдання 19 виконано!")
print("Графіки збережено у папці task_19_cauchy_arbitrary/")
print("=" * 60)
